; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v13 ?v3)
             (pred_2 ?v6 ?v8)
             (pred_6 ?v13 ?v8)
             (pred_11 ?v5 ?v13 )
	     (pred_1 ?v13)
             (pred_12 ?v7)
             (pred_5 ?v6)
             (pred_7 ?v8)
             (pred_3 ?v13)
             (pred_9 ?v6)
             (pred_8 ?v13)
             (pred_10 ))



(:action op_1
:parameters (?v1 ?v12 ?v11 ?v2)
:precondition (and (pred_12 ?v1) (pred_12 ?v12) (pred_5 ?v11) (pred_7 ?v2)
          (pred_4 ?v1 ?v12) (pred_2 ?v11 ?v2)
                   (pred_6 ?v12 ?v2) (pred_1 ?v1) 
                   (pred_3 ?v12) (pred_9 ?v11))
:effect (and  (pred_8 ?v12) (not (pred_3 ?v12))))


(:action op_3
:parameters (?v1 ?v10)
:precondition (and (pred_12 ?v1) (pred_12 ?v10)
               (pred_1 ?v1) (pred_4 ?v1 ?v10) (pred_8 ?v10))
:effect (and (pred_1 ?v10) (not (pred_1 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_12 ?v1) (pred_5 ?v11) 
                  (pred_1 ?v1) (pred_11 ?v11 ?v1) (pred_10 ))
:effect (and (pred_9 ?v11)
   (not (pred_11 ?v11 ?v1)) (not (pred_10 ))))


(:action op_4
:parameters (?v1 ?v4 ?v9)
:precondition (and (pred_12 ?v1) (pred_5 ?v4) (pred_5 ?v9)
                  (pred_1 ?v1) (pred_9 ?v9) (pred_11 ?v4 ?v1))
:effect (and (pred_9 ?v4) (pred_11 ?v9 ?v1)
        (not (pred_9 ?v9)) (not (pred_11 ?v4 ?v1))))

(:action op_2
:parameters (?v1 ?v11)
:precondition (and (pred_12 ?v1) (pred_5 ?v11) 
                  (pred_1 ?v1) (pred_9 ?v11))
:effect (and (pred_10 ) (pred_11 ?v11 ?v1) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_26 obj_04 obj_06 obj_27 obj_23 obj_22 obj_10 obj_03 obj_28 obj_08 obj_14 obj_05 obj_21 obj_16 obj_02 obj_09 obj_01 obj_13 obj_24 obj_25 obj_11 obj_12 obj_18 obj_20
    obj_29 obj_17
    obj_15 obj_30 obj_19
    )

    (:init
       (pred_10)

       (pred_12 obj_07)
       (pred_12 obj_26)
       (pred_12 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_27)
       (pred_12 obj_23)
       (pred_12 obj_22)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_28)
       (pred_12 obj_08)
       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_24)
       (pred_12 obj_25)
       (pred_12 obj_11)
       (pred_12 obj_12)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_7 obj_29)
       (pred_7 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_30)
       (pred_5 obj_19)

       (pred_4 obj_07 obj_23)
       (pred_4 obj_07 obj_26)
       (pred_4 obj_26 obj_22)
       (pred_4 obj_26 obj_04)
       (pred_4 obj_26 obj_07)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_26)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_27)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_27 obj_28)
       (pred_4 obj_27 obj_06)
       (pred_4 obj_23 obj_08)
       (pred_4 obj_23 obj_22)
       (pred_4 obj_23 obj_07)
       (pred_4 obj_22 obj_14)
       (pred_4 obj_22 obj_10)
       (pred_4 obj_22 obj_26)
       (pred_4 obj_22 obj_23)
       (pred_4 obj_10 obj_05)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_10 obj_22)
       (pred_4 obj_03 obj_21)
       (pred_4 obj_03 obj_28)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_28 obj_16)
       (pred_4 obj_28 obj_27)
       (pred_4 obj_28 obj_03)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_08 obj_23)
       (pred_4 obj_14 obj_09)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_14 obj_22)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_21 obj_13)
       (pred_4 obj_21 obj_16)
       (pred_4 obj_21 obj_03)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_16 obj_24)
       (pred_4 obj_16 obj_28)
       (pred_4 obj_16 obj_21)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_09 obj_14)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_13 obj_24)
       (pred_4 obj_13 obj_21)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_24 obj_20)
       (pred_4 obj_24 obj_16)
       (pred_4 obj_24 obj_13)
       (pred_4 obj_25 obj_11)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_25)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_20 obj_24)
       (pred_4 obj_20 obj_18)
       (pred_3 obj_18)
       (pred_3 obj_24)
       (pred_3 obj_26)
       (pred_6  obj_18 obj_29)
       (pred_6  obj_24 obj_17)
       (pred_6  obj_26 obj_17)
       (pred_8 obj_07)
       (pred_8 obj_04)
       (pred_8 obj_06)
       (pred_8 obj_27)
       (pred_8 obj_23)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_28)
       (pred_8 obj_08)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_13)
       (pred_8 obj_25)
       (pred_8 obj_11)
       (pred_8 obj_12)
       (pred_8 obj_20)

       (pred_2  obj_15 obj_29)
       (pred_2  obj_30 obj_17)
       (pred_2  obj_19 obj_29)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_30 obj_28)
       (pred_11 obj_19 obj_24)
       (pred_1 obj_25)
    )

    (:goal (and
       (pred_11 obj_30 obj_22)
    ))
(:constraints
  (always (not (pred_1 obj_03)))
)
)

; plan
1. (op_3 obj_25 obj_02)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_02)
   goals met: 0 of 1
2. (op_3 obj_02 obj_08)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_15)
   deleted: (pred_11 obj_15 obj_08) (pred_10)
   added: (pred_9 obj_15)
   goals met: 0 of 1
4. (op_3 obj_08 obj_23)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_23)
   goals met: 0 of 1
5. (op_3 obj_23 obj_22)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_22)
   goals met: 0 of 1
6. (op_2 obj_22 obj_15)
   deleted: (pred_9 obj_15)
   added: (pred_10) (pred_11 obj_15 obj_22)
   goals met: 0 of 1
7. (op_3 obj_22 obj_10)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_05)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_05)
   goals met: 0 of 1
9. (op_3 obj_05 obj_21)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_21)
   goals met: 0 of 1
10. (op_3 obj_21 obj_16)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_16)
   goals met: 0 of 1
11. (op_3 obj_16 obj_28)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_28)
   goals met: 0 of 1
12. (op_5 obj_28 obj_30)
   deleted: (pred_11 obj_30 obj_28) (pred_10)
   added: (pred_9 obj_30)
   goals met: 0 of 1
13. (op_3 obj_28 obj_27)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_27)
   goals met: 0 of 1
14. (op_3 obj_27 obj_06)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_06)
   goals met: 0 of 1
15. (op_3 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 0 of 1
16. (op_3 obj_04 obj_10)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_10)
   goals met: 0 of 1
17. (op_3 obj_10 obj_22)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_22)
   goals met: 0 of 1
18. (op_4 obj_22 obj_15 obj_30)
   deleted: (pred_9 obj_30) (pred_11 obj_15 obj_22)
   added: (pred_9 obj_15) (pred_11 obj_30 obj_22)
   goals met: 1 of 1
